# დაწერეთ პითონის პროგრამა, რომელიც ჯერ ქმნის სტრინგ 'გამარჯობას', შემდეგ ქმნის სტრინგ 'ელემენტი' - ათჯერ ( ერთ ხაზზე ), შემდეგ ქმნის ინტეჯერ 1000- ორი ინტეჯერი რიცვის მეშვეობით, შემდეგ ქმნის სტრინგ 'hello world' - ორი სტრინგის მეშვეობით , და ბოლოს ქმნის ბულეანს, თუმცა არა პირდაპირ True ან False-ის დაწერით ( მინიშნება დაგჭირდებათ მოცემულიდან, რომელიმე ოპერაციების გამოყენება რომელიმე პროგრამის ნაწილში: +, -, *, / )

print("გამარჯობა")
print("ელემენტი"*10)

a=500
b=2
print(a*b)

c="hello"
g="world"
print(c+g)

print(10>5)
print(10>11)

