# # დაწერეთ პროგრამა რომელსაც გადმოეცემა ნებისმიერი ლისტი სადაც ელემენტებად გადაცემულაი ინტეჯერები, თქვენი მიზანია გადაუყვეთ ამ ლისტს (while loop) და გამოიტანოთ ამ რიცხვების ჯამი.

# def ow(list):
#     summ=0
#     ind=0
#     while ind<len(list):
#         summ+=list[ind]
#         ind+=1
#     return summ
# print(ow([1,23,5,5,6,]))


# # While loop-ით გადაუყევით ლისტს რომელშიც იქნება მოთავსებული სტრინგები (ასოები), თქვენი დავალებაა, რომ ეს სტრინგები საბოლოოდ ერთი მთლიანი სტრინგის სახით გამოიტანოთ.,
# # ,


# def strS(ad):
#     strr=""
#     ind=0
#     while ind<len(ad):
#         strr+=ad[ind]
#         ind+=1
#     return strr
# print(strS(["ad", "daa", "dad"]))