#შექმენით list-ი შემდეგი მნიშვნელობებით: [1,4,3,6,9,11,17,13,26,30], თქვენი დავალებაა გამოტანოთ ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა
lst= [1,4,3,6,9,11,17,13,26,30]
def func(lst):
    count1=0
    count=0
    for i in lst:
        if i%2==0:
            count1+=i
        elif i%2==1:
            count+=1
    return f"რაოდენობა {count}, ჯამი {count1}"
        
print(func(lst))



#შექმნით list და ბოლოში ჩაამატეთ ნებისმიერი მნიშვნელობა (append)

num=[12,32,5,46,65,34,]
res=[]
res.append(num)
print(res)

#მოცემული list-იდან: [1,2,3,3,4,5] ამოშალეთ ის რიცხვი რომელიც არღვევს თანმიმდევრობას (pop)
numm=[1,2,3,3,4,5]
numm.pop(3)
print(numm)

#list-ში: [1,2,3,4,6,8,9] ჩაამატეთ ის ციფრები რომელიც არის გამოტოვებული (insert)
nls=[1,2,3,4,6,8,9]
nls.insert(4,5)
print(nls)

#კომენტარის სახით დაწერეთ რას აკეთებს append, pop, insert
"""""
append გვაძლევს იმის საშუალებას რომ ლისტში შევიტანოთ ჩვენი სასურველი სიდიდეები
pop გვაძლევს იმის შაშუალებას რომ ლისტს ამოვაკლოთ მისი შემადგენელი კომპონენტები სასურველი ინდექსის მითითებით
insert  გვაძლევს იმის საშუალებას რომ ლისტშო სასურველ ინდექსის ადგილას ახალი კომპონენტი დავამატოთ
"""""