#1) მომხმარებელს შემოატანინეთ ოთხი რიცხვი და გამოიტანეთ მათი საშუალო არითმეტიკული.
num1=input("number1")
num2=input("number2")
num3=input("number3")
num4=input("nmber4")
print(int(int(num1)+int(num2)+int(num3)+int(num4))/4)
#2) მომხმარებელს შემოატანინეთ სახელი და გვარი, შემდეგ გამოპრინტეთ ტექსტი: „მოგესალმები, [სახელი] [გვარი]!“
name=input("name")
surname=input("surname")
print("მოგესალმები"+" "+name+" "+surname)
#3) მომხმარებელს შემოატანინეთ ორი რიცხვი და გამოიტანეთ მათი სტრინგებად გაერთიანებული ვერსია, რომლის შუაშიც იქნება "" ემოჯი.
number1=input("dawere")
number2=input("dawere meore ricxvi")
print(number1+"😂"+number2)