#davaleba araa ubralod chemit vivarsjishe

#მომხმარებელს შემოატანინე მისი ასაკი,შემდეგ შეამოწმე ტუ მომხმარებლის შემოტანილი ასაკი არის 18 ზე ნაკლები, დაუპრინტე რომ ის არ არის სრულწლოვანი,თუ მომხმარებლის შემოტანილი ასააკი არის 18,დაუპრინტე რომ ის არის სრულწლოვანი, თუ მომხმარებლის შემოტანილი ასაკი არის 18ზე მეტი მაშინ დაუპრინტე რომ უკვე დიდია
 
age=int(input("enter your age"))
if age<18:
    print("you're underage")
elif age==18:
    print("you're of legal age")
else:
    print("you're already too old")

#მომხმარებელს შეეკითხე მისი სახელი, შეამოწმე თუ მისი სახელი უდრის გიორგის მაშინ უთხარი რომ მეც გიორგი მქვია,შემდეგ შეამოწმე თუ მმომხმარებლის შემოტანილი სახელი არის ლაშა,დაუპრინტე რომ ეგ სახელი მოგოწნს,სხვა შემთხვევაში უთხარი რომ არ გაინტერესებს მისი სახელი

name=input("enter your name")
if name=="Giorgi":
    print("i am Giorgi too")
elif name=="Lasha":
    print("i like your name")
else :
    print("i dont care about your name")

#შექმენი 6 ცვლადი სადაც შეინახავ მნიშვნელობად სახელს,გვარს,საცხოვრებელ ადგილს,ასაკს და წონას,ტერმინალში გამოიტანე ამ ექვსი ცვლადის მნიშვნელობა ერთ წინადადებაში და ასევე space ბით  გამოყავი ერთმანეთისსაგან(გადაბმული არ იყოს)
Name="giorgi"
surname="nastarashvili"
living_place="mukuzani"
Age="16" 
weight="70kg"
height="1.89cm"
print(Name+" "+surname+" "+living_place+" "+Age+" "+weight+" "+height)

#მომხმარებლის შემოატანინე მისი ასაკი,სახელი და წონა,ამის შემდეჰ თუ მისი შემოტანილი სამივე მნიშვნელობა ემთხვევა შენს ასაკს სახელს და წონას,დაუპრინტე True სხვა შემთხვევაში დაუპრინტე False 

user_name = input("შეიყვანე შენი სახელი: ")
user_age = int(input("შეიყვანე შენი ასაკი: "))
user_weight = float(input("შეიყვანე შენი წონა: "))

my_name = "giorgi"
my_age = 16
my_weight = 70

if user_name == my_name and user_age == my_age and user_weight == my_weight:
    print(True)
else:
    print(False)

#შენი სიტყვებით ახსენი კიდევ ერთხელ რა არის სტინგი,ინტეჯერი,ბულეანი,ფლოუთი და ოთხივე მათგანს მიუწერე თავისი მაგალითები,ასევე ახსენი
#რა არის და რას აკეთებს input და მოიყვანე მისი მაგალითი

#string-ნებისმიერი რამ რაც არის ბრჭყალებში მოქცეული "" ან '' მაგ "gio" ინტეჯერის და ფლოუთის სახის რიცხვები სტრინგი ხდება ბრჭყალებში
#integer - მთელი რიცხვები მაგ-8
#boolean true ან false გვეხმარება კონკრეტული განძრახვის განხორციელებაში მოცემული "ხელსაწყოების საშუალებით": If, elif, else,==,>,<.
# მაგ:10<8 
#float-წილადი რიცხვები მაგალითად 1.4
#input()მომხმარებელს საშუალებას აძლევს რომ ცვლადში შეიტანოს ინფორმაცია.

#მომხმარებელს შემოატანინე ნებისმიერი რიცხვი, ასევე შემოატანინე მისი გვარი და ტერმინალში გამოიტანე იმდენი ცალი მომხმარებლის შემოტანილი
#სახელი რამდენი რიცხვიც მან შემოიტანა.ერთ წინადადებად
numb1=int(input("eneter any number"))
surname=input("enter your surname: ")
print(surname*numb1)


#შექმენი 4 ცვლადი,ორ ცვლადს მიანიჭე მნიშვნელობად ნებისმიერი რიცხვები მაგრამ ეს რიცხვები იყოს სტრინგის ტიპის,შემდეგ ორ ცვლადს
# მიანიჭე მნიშვნელობად ნებისმიერი რიცხვები მაგრამ ეს რიცხვები იყოს ინტეჯერის ტიპის,შემდეგ გამოიტანე ამ ოთხი რიცხვის ჯამი ტერმინალში
num1="1"
num2="2"
num3=4
num4=3
print(int(num1)+int(num2)+num3+num4)
